avrdudes/avr-libc/include/avr/ioavr64du28.h
/* Clock Failure Detect Source select bit group values */
typedef enum CLKCTRL_CFDSRC_VALUES_enum
{
    CLKCTRL_CFDSRC_CLKMAIN_gv      = 0x00,  /* Main Clock */
    CLKCTRL_CFDSRC_XOSCHF_gv       = 0x01,  /* XOSCHF */
    CLKCTRL_CFDSRC_XOSC32K_gv      = 0x02   /* XOSC32K */
} CLKCTRL_CFDSRC_values_t;

/* Clock Failure Detect Source select bit group configurations*/
typedef enum CLKCTRL_CFDSRC_enum
{
    CLKCTRL_CFDSRC_CLKMAIN_gc      = (CLKCTRL_CFDSRC_CLKMAIN_gv << CLKCTRL_CFDSRC_gp),  /* Main Clock */
    CLKCTRL_CFDSRC_XOSCHF_gc       = (CLKCTRL_CFDSRC_XOSCHF_gv << CLKCTRL_CFDSRC_gp),  /* XOSCHF */
    CLKCTRL_CFDSRC_XOSC32K_gc      = (CLKCTRL_CFDSRC_XOSC32K_gv << CLKCTRL_CFDSRC_gp)   /* XOSC32K */
} CLKCTRL_CFDSRC_t;

/* Clock select bit group values */
typedef enum CLKCTRL_CLKSEL_VALUES_enum
{
    CLKCTRL_CLKSEL_OSCHF_gv        = 0x00,  /* Internal high-frequency oscillator */
    CLKCTRL_CLKSEL_OSC32K_gv       = 0x01,  /* Internal 32.768 kHz oscillator */
    CLKCTRL_CLKSEL_XOSC32K_gv      = 0x02,  /* 32.768 kHz crystal oscillator */
    CLKCTRL_CLKSEL_EXTCLK_gv       = 0x03   /* External clock */
} CLKCTRL_CLKSEL_values_t;

/* Clock select bit group configurations*/
typedef enum CLKCTRL_CLKSEL_enum
{
    CLKCTRL_CLKSEL_OSCHF_gc        = (CLKCTRL_CLKSEL_OSCHF_gv << CLKCTRL_CLKSEL_gp),  /* Internal high-frequency oscillator */
    CLKCTRL_CLKSEL_OSC32K_gc       = (CLKCTRL_CLKSEL_OSC32K_gv << CLKCTRL_CLKSEL_gp),  /* Internal 32.768 kHz oscillator */
    CLKCTRL_CLKSEL_XOSC32K_gc      = (CLKCTRL_CLKSEL_XOSC32K_gv << CLKCTRL_CLKSEL_gp),  /* 32.768 kHz crystal oscillator */
    CLKCTRL_CLKSEL_EXTCLK_gc       = (CLKCTRL_CLKSEL_EXTCLK_gv << CLKCTRL_CLKSEL_gp)   /* External clock */
} CLKCTRL_CLKSEL_t;

/* Crystal startup time select bit group values */
typedef enum CLKCTRL_CSUT_VALUES_enum
{
    CLKCTRL_CSUT_1K_gv             = 0x00,  /* 1k cycles */
    CLKCTRL_CSUT_16K_gv            = 0x01,  /* 16k cycles */
    CLKCTRL_CSUT_32K_gv            = 0x02,  /* 32k cycles */
    CLKCTRL_CSUT_64K_gv            = 0x03   /* 64k cycles */
} CLKCTRL_CSUT_values_t;

/* Crystal startup time select bit group configurations*/
typedef enum CLKCTRL_CSUT_enum
{
    CLKCTRL_CSUT_1K_gc             = (CLKCTRL_CSUT_1K_gv << CLKCTRL_CSUT_gp),  /* 1k cycles */
    CLKCTRL_CSUT_16K_gc            = (CLKCTRL_CSUT_16K_gv << CLKCTRL_CSUT_gp),  /* 16k cycles */
    CLKCTRL_CSUT_32K_gc            = (CLKCTRL_CSUT_32K_gv << CLKCTRL_CSUT_gp),  /* 32k cycles */
    CLKCTRL_CSUT_64K_gc            = (CLKCTRL_CSUT_64K_gv << CLKCTRL_CSUT_gp)   /* 64k cycles */
} CLKCTRL_CSUT_t;

/* Start-up Time Select bit group values */
typedef enum CLKCTRL_CSUTHF_VALUES_enum
{
    CLKCTRL_CSUTHF_256_gv          = 0x00,  /* 256 XOSCHF cycles */
    CLKCTRL_CSUTHF_1K_gv           = 0x01,  /* 1K XOSCHF cycles */
    CLKCTRL_CSUTHF_4K_gv           = 0x02   /* 4K XOSCHF cycles */
} CLKCTRL_CSUTHF_values_t;

/* Start-up Time Select bit group configurations*/
typedef enum CLKCTRL_CSUTHF_enum
{
    CLKCTRL_CSUTHF_256_gc          = (CLKCTRL_CSUTHF_256_gv << CLKCTRL_CSUTHF_gp),  /* 256 XOSCHF cycles */
    CLKCTRL_CSUTHF_1K_gc           = (CLKCTRL_CSUTHF_1K_gv << CLKCTRL_CSUTHF_gp),  /* 1K XOSCHF cycles */
    CLKCTRL_CSUTHF_4K_gc           = (CLKCTRL_CSUTHF_4K_gv << CLKCTRL_CSUTHF_gp)   /* 4K XOSCHF cycles */
} CLKCTRL_CSUTHF_t;

/* Frequency Range select bit group values */
typedef enum CLKCTRL_FRQRANGE_VALUES_enum
{
    CLKCTRL_FRQRANGE_8M_gv         = 0x00,  /* Max 8 MHz XTAL Frequency */
    CLKCTRL_FRQRANGE_16M_gv        = 0x01,  /* Max 16 MHz XTAL Frequency */
    CLKCTRL_FRQRANGE_24M_gv        = 0x02,  /* Max 24 MHz XTAL Frequency */
    CLKCTRL_FRQRANGE_32M_gv        = 0x03   /* Max 32 MHz XTAL Frequency */
} CLKCTRL_FRQRANGE_values_t;

/* Frequency Range select bit group configurations*/
typedef enum CLKCTRL_FRQRANGE_enum
{
    CLKCTRL_FRQRANGE_8M_gc         = (CLKCTRL_FRQRANGE_8M_gv << CLKCTRL_FRQRANGE_gp),  /* Max 8 MHz XTAL Frequency */
    CLKCTRL_FRQRANGE_16M_gc        = (CLKCTRL_FRQRANGE_16M_gv << CLKCTRL_FRQRANGE_gp),  /* Max 16 MHz XTAL Frequency */
    CLKCTRL_FRQRANGE_24M_gc        = (CLKCTRL_FRQRANGE_24M_gv << CLKCTRL_FRQRANGE_gp),  /* Max 24 MHz XTAL Frequency */
    CLKCTRL_FRQRANGE_32M_gc        = (CLKCTRL_FRQRANGE_32M_gv << CLKCTRL_FRQRANGE_gp)   /* Max 32 MHz XTAL Frequency */
} CLKCTRL_FRQRANGE_t;

/* Frequency select bit group values */
typedef enum CLKCTRL_FRQSEL_VALUES_enum
{
    CLKCTRL_FRQSEL_1M_gv           = 0x00,  /* 1 MHz system clock */
    CLKCTRL_FRQSEL_2M_gv           = 0x01,  /* 2 MHz system clock */
    CLKCTRL_FRQSEL_3M_gv           = 0x02,  /* 3 MHz system clock */
    CLKCTRL_FRQSEL_4M_gv           = 0x03,  /* 4 MHz system clock (default) */
    CLKCTRL_FRQSEL_8M_gv           = 0x05,  /* 8 MHz system clock */
    CLKCTRL_FRQSEL_12M_gv          = 0x06,  /* 12 MHz system clock */
    CLKCTRL_FRQSEL_16M_gv          = 0x07,  /* 16 MHz system clock */
    CLKCTRL_FRQSEL_20M_gv          = 0x08,  /* 20 MHz system clock */
    CLKCTRL_FRQSEL_24M_gv          = 0x09   /* 24 MHz system clock */
} CLKCTRL_FRQSEL_values_t;

/* Frequency select bit group configurations*/
typedef enum CLKCTRL_FRQSEL_enum
{
    CLKCTRL_FRQSEL_1M_gc           = (CLKCTRL_FRQSEL_1M_gv << CLKCTRL_FRQSEL_gp),  /* 1 MHz system clock */
    CLKCTRL_FRQSEL_2M_gc           = (CLKCTRL_FRQSEL_2M_gv << CLKCTRL_FRQSEL_gp),  /* 2 MHz system clock */
    CLKCTRL_FRQSEL_3M_gc           = (CLKCTRL_FRQSEL_3M_gv << CLKCTRL_FRQSEL_gp),  /* 3 MHz system clock */
    CLKCTRL_FRQSEL_4M_gc           = (CLKCTRL_FRQSEL_4M_gv << CLKCTRL_FRQSEL_gp),  /* 4 MHz system clock (default) */
    CLKCTRL_FRQSEL_8M_gc           = (CLKCTRL_FRQSEL_8M_gv << CLKCTRL_FRQSEL_gp),  /* 8 MHz system clock */
    CLKCTRL_FRQSEL_12M_gc          = (CLKCTRL_FRQSEL_12M_gv << CLKCTRL_FRQSEL_gp),  /* 12 MHz system clock */
    CLKCTRL_FRQSEL_16M_gc          = (CLKCTRL_FRQSEL_16M_gv << CLKCTRL_FRQSEL_gp),  /* 16 MHz system clock */
    CLKCTRL_FRQSEL_20M_gc          = (CLKCTRL_FRQSEL_20M_gv << CLKCTRL_FRQSEL_gp),  /* 20 MHz system clock */
    CLKCTRL_FRQSEL_24M_gc          = (CLKCTRL_FRQSEL_24M_gv << CLKCTRL_FRQSEL_gp)   /* 24 MHz system clock */
} CLKCTRL_FRQSEL_t;

/* Interrupt type select bit group values */
typedef enum CLKCTRL_INTTYPE_VALUES_enum
{
    CLKCTRL_INTTYPE_INT_gv         = 0x00,  /* Regular Interrupt */
    CLKCTRL_INTTYPE_NMI_gv         = 0x01   /* NMI */
} CLKCTRL_INTTYPE_values_t;

/* Interrupt type select bit group configurations*/
typedef enum CLKCTRL_INTTYPE_enum
{
    CLKCTRL_INTTYPE_INT_gc         = (CLKCTRL_INTTYPE_INT_gv << CLKCTRL_INTTYPE_bp),  /* Regular Interrupt */
    CLKCTRL_INTTYPE_NMI_gc         = (CLKCTRL_INTTYPE_NMI_gv << CLKCTRL_INTTYPE_bp)   /* NMI */
} CLKCTRL_INTTYPE_t;

/* Prescaler division select bit group values */
typedef enum CLKCTRL_PDIV_VALUES_enum
{
    CLKCTRL_PDIV_DIV2_gv           = 0x00,  /* Divide by 2 */
    CLKCTRL_PDIV_DIV4_gv           = 0x01,  /* Divide by 4 */
    CLKCTRL_PDIV_DIV8_gv           = 0x02,  /* Divide by 8 */
    CLKCTRL_PDIV_DIV16_gv          = 0x03,  /* Divide by 16 */
    CLKCTRL_PDIV_DIV32_gv          = 0x04,  /* Divide by 32 */
    CLKCTRL_PDIV_DIV64_gv          = 0x05,  /* Divide by 64 */
    CLKCTRL_PDIV_DIV6_gv           = 0x08,  /* Divide by 6 */
    CLKCTRL_PDIV_DIV10_gv          = 0x09,  /* Divide by 10 */
    CLKCTRL_PDIV_DIV12_gv          = 0x0A,  /* Divide by 12 */
    CLKCTRL_PDIV_DIV24_gv          = 0x0B,  /* Divide by 24 */
    CLKCTRL_PDIV_DIV48_gv          = 0x0C   /* Divide by 48 */
} CLKCTRL_PDIV_values_t;

/* Prescaler division select bit group configurations*/
typedef enum CLKCTRL_PDIV_enum
{
    CLKCTRL_PDIV_DIV2_gc           = (CLKCTRL_PDIV_DIV2_gv << CLKCTRL_PDIV_gp),  /* Divide by 2 */
    CLKCTRL_PDIV_DIV4_gc           = (CLKCTRL_PDIV_DIV4_gv << CLKCTRL_PDIV_gp),  /* Divide by 4 */
    CLKCTRL_PDIV_DIV8_gc           = (CLKCTRL_PDIV_DIV8_gv << CLKCTRL_PDIV_gp),  /* Divide by 8 */
    CLKCTRL_PDIV_DIV16_gc          = (CLKCTRL_PDIV_DIV16_gv << CLKCTRL_PDIV_gp),  /* Divide by 16 */
    CLKCTRL_PDIV_DIV32_gc          = (CLKCTRL_PDIV_DIV32_gv << CLKCTRL_PDIV_gp),  /* Divide by 32 */
    CLKCTRL_PDIV_DIV64_gc          = (CLKCTRL_PDIV_DIV64_gv << CLKCTRL_PDIV_gp),  /* Divide by 64 */
    CLKCTRL_PDIV_DIV6_gc           = (CLKCTRL_PDIV_DIV6_gv << CLKCTRL_PDIV_gp),  /* Divide by 6 */
    CLKCTRL_PDIV_DIV10_gc          = (CLKCTRL_PDIV_DIV10_gv << CLKCTRL_PDIV_gp),  /* Divide by 10 */
    CLKCTRL_PDIV_DIV12_gc          = (CLKCTRL_PDIV_DIV12_gv << CLKCTRL_PDIV_gp),  /* Divide by 12 */
    CLKCTRL_PDIV_DIV24_gc          = (CLKCTRL_PDIV_DIV24_gv << CLKCTRL_PDIV_gp),  /* Divide by 24 */
    CLKCTRL_PDIV_DIV48_gc          = (CLKCTRL_PDIV_DIV48_gv << CLKCTRL_PDIV_gp)   /* Divide by 48 */
} CLKCTRL_PDIV_t;

/* Select bit group values */
typedef enum CLKCTRL_SEL_VALUES_enum
{
    CLKCTRL_SEL_XTAL_gv            = 0x00,  /* External crystal connected to the XTAL32K1 and XTAL32K2 pins */
    CLKCTRL_SEL_EXTCLK_gv          = 0x01   /* External clock on the XTAL32K1 pin */
} CLKCTRL_SEL_values_t;

/* Select bit group configurations*/
typedef enum CLKCTRL_SEL_enum
{
    CLKCTRL_SEL_XTAL_gc            = (CLKCTRL_SEL_XTAL_gv << CLKCTRL_SEL_bp),  /* External crystal connected to the XTAL32K1 and XTAL32K2 pins */
    CLKCTRL_SEL_EXTCLK_gc          = (CLKCTRL_SEL_EXTCLK_gv << CLKCTRL_SEL_bp)   /* External clock on the XTAL32K1 pin */
} CLKCTRL_SEL_t;

/* External Source Select bit group values */
typedef enum CLKCTRL_SELHF_VALUES_enum
{
    CLKCTRL_SELHF_XTAL_gv          = 0x00,  /* External Crystal */
    CLKCTRL_SELHF_EXTCLK_gv        = 0x01   /* External clock on XTALHF1 pin */
} CLKCTRL_SELHF_values_t;

/* External Source Select bit group configurations*/
typedef enum CLKCTRL_SELHF_enum
{
    CLKCTRL_SELHF_XTAL_gc          = (CLKCTRL_SELHF_XTAL_gv << CLKCTRL_SELHF_bp),  /* External Crystal */
    CLKCTRL_SELHF_EXTCLK_gc        = (CLKCTRL_SELHF_EXTCLK_gv << CLKCTRL_SELHF_bp)   /* External clock on XTALHF1 pin */
} CLKCTRL_SELHF_t;

